Revit 2026 API

# AdvancedLayeredLayeredRoughness Property

---

The property labeled "Roughness" from the "AdvancedLayered" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string LayeredRoughness { get; }
```
```vb
Public Shared ReadOnly Property LayeredRoughness As String
	Get
```
```cpp
public:
static property String^ LayeredRoughness {
	String^ get ();
}
```
```fsharp
static member LayeredRoughness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

AdvancedLayered Class

Autodesk.Revit.DB.Visual Namespace